<template>
  <div class="QnA">
    <ul>
      <li
          v-bind:key = "qna.key"
          v-for="qna in accordionData02"
      >
        <strong class="q-title" v-on:click="qna.state = !qna.state"> {{ qna.title }}</strong>
        <ul class="q-answer" v-if="qna.state">
          <li v-bind:key = "qna.key + '-' + index" v-for="(value, index) in qna.content">{{ value }}</li>
        </ul>
      </li>
    </ul>
  </div>
</template>

<script lang="ts">
  import { Component,Vue } from 'vue-property-decorator';
  
  /*interface AccordionData02 {
    key: string;
    title: string;
    content: string;
    state: boolean;
  }*/
  
  @Component
  export default class QnA extends Vue {
    accordionData01 =  [
      {
        key: 'faq01',
        title: '코로나바이러스는 어떤 바이러스인가요?',
        content: '○ 코로나바이러스는 동물 및 사람에게 전파될 수 있는 바이러스로 그중 사람에게 전파가능한 사람 코로나바이러스는 기존에 6종이 알려져 있습니다.\n○ 이중 4종은 감기와 같은 질병을 일으키는 바이러스이며, 나머지 2종은 각각 MERS-CoV와 SARS-CoV로 알려져 있습니다.\n○ 이번 유행의 원인 바이러스는 새로운 코로나바이러스( SARS-CoV-2)로 공개된 염기서열 분석을 통해 코로나19 바이러스가 박쥐유래 사스유사 바이러스와 89.1% 일치하는 것을 확인하였습니다.',
        state:false
      },
      {
        key: 'faq02',
        title: '코로나19는 어떻게 전염되나요?',
        content: '○ 코로나19는 감염된 사람이 기침, 재채기를 했을 때 발생한 비말이 다른 사람의 호흡기로 들어가거나, 눈·코·입 등을 만질 때 손에 묻은 바이러스가 점막을 통해 침투하여 전염이 됩니다.\n○ 또는 감염된 사람의 비말이 물건 표면 등에 묻은 경우, 다른 사람이 이 물건을 만진 후 눈, 코, 입 등을 만지게 되면 점막을 통해 바이러스가 침투하여 전염이 되므로 올바른 손씻기를 철저히 수행해야 합니다.',
        state:false
      },
      {
        key: 'faq03',
        title: '코로나19의 증상은 어떤 것이 있나요?',
        content: '○ 코로나19의 가장 흔한 증상은 발열, 피로 및 마른 기침이고, 일부 환자는 통증, 코 막힘, 콧물, 인후염 또는 설사를 경험할 수 있습니다. 이러한 증상은 대개 경미하게 나타나고, 어떤 사람들은 감염되지만 증상이 나타나지 않고 불편함을 느끼지 않을 수도 있습니다.\n○ 대부분의 환자들(약 80%)은 특별한 치료 없이 회복되나, 고령자나 고혈압, 심장질환 또는 당뇨병과 같은 기저질환이 있는 사람들은 중증으로 진행될 가능성이 높아 발열, 기침, 호흡 곤란이 있는 사람은 치료를 받아야합니다.',
        state:false
      },
      {
        key: 'faq04',
        title: '무증상에서도 전파되나요?',
        content: '○ 코로나19의 주요 전파 방법은 기침을 하는 환자가 배출한 비말의 흡입 또는 접촉입니다.  무증상 자로부터 감염 될 위험성은 매우 낮으나 코로나19에 감염된 많은 사람들의 초기증상이 경미하여 증상을 크게 느끼지 못하기 때문에 이러한 환자에게서 코로나19가 감염될 수 있습니다.\n○ 코로나19의 전파 기간에 대한 연구의 평가가 지속되고 있어, 결과가 발표되면 공유할 예정입니다.',
        state:false
      }
    ]
  
    accordionData02 = [
      {
        key: 'faq001',
        title: '코로나바이러스는 어떤 바이러스인가요?',
        content: [
          '○ 코로나바이러스는 동물 및 사람에게 전파될 수 있는 바이러스로 그중 사람에게 전파가능한 사람 코로나바이러스는 기존에 6종이 알려져 있습니다.',
          '○ 이중 4종은 감기와 같은 질병을 일으키는 바이러스이며, 나머지 2종은 각각 MERS-CoV와 SARS-CoV로 알려져 있습니다.',
          '○ 이번 유행의 원인 바이러스는 새로운 코로나바이러스( SARS-CoV-2)로 공개된 염기서열 분석을 통해 코로나19 바이러스가 박쥐유래 사스유사 바이러스와 89.1% 일치하는 것을 확인하였습니다.'
        ],
        state:false
      },
      {
        key: 'faq002',
        title: '코로나19는 어떻게 전염되나요?',
        content: [
          '○ 코로나19는 감염된 사람이 기침, 재채기를 했을 때 발생한 비말이 다른 사람의 호흡기로 들어가거나, 눈·코·입 등을 만질 때 손에 묻은 바이러스가 점막을 통해 침투하여 전염이 됩니다.',
          '○ 또는 감염된 사람의 비말이 물건 표면 등에 묻은 경우, 다른 사람이 이 물건을 만진 후 눈, 코, 입 등을 만지게 되면 점막을 통해 바이러스가 침투하여 전염이 되므로 올바른 손씻기를 철저히 수행해야 합니다.'
        ],
        state:false
      },
      {
        key: 'faq003',
        title: '코로나19의 증상은 어떤 것이 있나요?',
        content: [
          '○ 코로나19의 가장 흔한 증상은 발열, 피로 및 마른 기침이고, 일부 환자는 통증, 코 막힘, 콧물, 인후염 또는 설사를 경험할 수 있습니다. 이러한 증상은 대개 경미하게 나타나고, 어떤 사람들은 감염되지만 증상이 나타나지 않고 불편함을 느끼지 않을 수도 있습니다.',
          '○ 대부분의 환자들(약 80%)은 특별한 치료 없이 회복되나, 고령자나 고혈압, 심장질환 또는 당뇨병과 같은 기저질환이 있는 사람들은 중증으로 진행될 가능성이 높아 발열, 기침, 호흡 곤란이 있는 사람은 치료를 받아야합니다.'
        ],
        state:false
      },
      {
        key: 'faq004',
        title: '무증상에서도 전파되나요?',
        content: [
          '○ 코로나19의 주요 전파 방법은 기침을 하는 환자가 배출한 비말의 흡입 또는 접촉입니다.  무증상 자로부터 감염 될 위험성은 매우 낮으나 코로나19에 감염된 많은 사람들의 초기증상이 경미하여 증상을 크게 느끼지 못하기 때문에 이러한 환자에게서 코로나19가 감염될 수 있습니다.',
          '○ 코로나19의 전파 기간에 대한 연구의 평가가 지속되고 있어, 결과가 발표되면 공유할 예정입니다.'
        ],
        state:false
      }
    ]
  }

</script>

<style scoped>
ul{list-style:none}
</style>